Revit 2027 API
GroupSet.Insert Method
Insert the specified group into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Group item
)
Public Overridable Function Insert (
	item As Group
) As Boolean
public:
virtual bool Insert(
	Group^ item
)
abstract Insert :
        item : Group -> bool
override Insert :
        item : Group -> bool
Parameters
item Group
The group to be inserted into the set.
Return Value
Boolean
Returns whether the group was inserted into the set.
See Also
Reference
GroupSet Class
Autodesk.Revit.DB Namespace